[
  {
    "Id": 1,
    "jobId": "1",
    "candidateId": "1",
    "status": "Interview",
    "appliedDate": "2024-01-16T09:30:00.000Z",
    "coverLetter": "I am excited to apply for the Senior Frontend Developer position at TechFlow Solutions. With over 5 years of React experience and a strong background in TypeScript, I believe I would be a perfect fit for your team. I have successfully built scalable web applications that serve thousands of users daily.",
    "notes": "Strong technical background, good culture fit",
    "interviews": [
      {
        "date": "2024-01-22T14:00:00.000Z",
        "type": "Technical",
        "status": "Scheduled"
      }
    ]
  },
  {
    "Id": 2,
    "jobId": "2",
    "candidateId": "2",
    "status": "Offer",
    "appliedDate": "2024-01-13T11:15:00.000Z",
    "coverLetter": "I am writing to express my interest in the Product Manager role at InnovateCorp. My 6 years of product management experience, combined with my technical background, make me an ideal candidate for this position. I have successfully launched products that have generated millions in revenue.",
    "notes": "Excellent product sense, strong leadership experience",
    "interviews": [
      {
        "date": "2024-01-18T10:00:00.000Z",
        "type": "Behavioral",
        "status": "Completed"
      },
      {
        "date": "2024-01-19T15:30:00.000Z",
        "type": "Case Study",
        "status": "Completed"
      }
    ]
  },
  {
    "Id": 3,
    "jobId": "3",
    "candidateId": "3",
    "status": "Reviewing",
    "appliedDate": "2024-01-11T16:45:00.000Z",
    "coverLetter": "I am thrilled to apply for the UX/UI Designer position at DesignStudio Pro. With 5+ years of experience in user experience design and a portfolio showcasing diverse projects, I am confident in my ability to create exceptional user experiences for your clients.",
    "notes": "Great portfolio, strong design skills",
    "interviews": []
  },
  {
    "Id": 4,
    "jobId": "4",
    "candidateId": "4",
    "status": "Applied",
    "appliedDate": "2024-01-15T14:20:00.000Z",
    "coverLetter": "I am interested in the DevOps Engineer position at CloudTech Systems. My extensive experience with AWS, Kubernetes, and CI/CD pipelines aligns perfectly with your requirements. I have successfully managed cloud infrastructure that scales to handle millions of requests.",
    "notes": "",
    "interviews": []
  },
  {
    "Id": 5,
    "jobId": "5",
    "candidateId": "5",
    "status": "Interview",
    "appliedDate": "2024-01-14T12:00:00.000Z",
    "coverLetter": "I am excited to apply for the Data Scientist position at Analytics Plus. With my PhD in Data Science and 5+ years of experience building machine learning models, I am well-equipped to contribute to your data science initiatives and drive meaningful insights from your data.",
    "notes": "PhD qualified, strong ML background",
    "interviews": [
      {
        "date": "2024-01-21T13:00:00.000Z",
        "type": "Technical",
        "status": "Scheduled"
      }
    ]
  },
  {
    "Id": 6,
    "jobId": "6",
    "candidateId": "6",
    "status": "Applied",
    "appliedDate": "2024-01-14T10:30:00.000Z",
    "coverLetter": "I am writing to apply for the Marketing Specialist position at GrowthHub Inc. My 5+ years of digital marketing experience and proven track record of driving growth make me an ideal candidate for this remote opportunity. I have successfully managed campaigns that generated millions in revenue.",
    "notes": "",
    "interviews": []
  },
  {
    "Id": 7,
    "jobId": "7",
    "candidateId": "1",
    "status": "Rejected",
    "appliedDate": "2024-01-12T09:15:00.000Z",
    "coverLetter": "I am interested in the Backend Developer position at ServerPro Solutions. While my primary experience is in frontend development, I have worked extensively with Node.js and RESTful APIs, and I am eager to transition into a more backend-focused role.",
    "notes": "More frontend focused, not the right fit for this backend role",
    "interviews": []
  },
  {
    "Id": 8,
    "jobId": "1",
    "candidateId": "3",
    "status": "Applied",
    "appliedDate": "2024-01-17T13:45:00.000Z",
    "coverLetter": "I am applying for the Senior Frontend Developer position at TechFlow Solutions. As a UX/UI designer with strong frontend development skills, I can bring both design sensibility and technical expertise to your development team.",
    "notes": "",
    "interviews": []
  },
  {
    "Id": 9,
    "jobId": "2",
    "candidateId": "4",
    "status": "Applied",
    "appliedDate": "2024-01-16T15:20:00.000Z",
    "coverLetter": "I am interested in exploring the Product Manager role at InnovateCorp. My technical background as a DevOps Engineer has given me unique insights into product development and infrastructure considerations that would be valuable in a product management role.",
    "notes": "",
    "interviews": []
  },
  {
    "Id": 10,
    "jobId": "8",
    "candidateId": "6",
    "status": "Reviewing",
    "appliedDate": "2024-01-10T11:30:00.000Z",
    "coverLetter": "I am excited to apply for the Sales Manager position at SalesForce Dynamics. My marketing background has given me strong customer insights and relationship-building skills that would translate well to sales leadership.",
    "notes": "Interesting background, could be good for sales",
    "interviews": []
  }
]